# Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму.
# Пример:
# - Для n = 6: [2.0, 2.25, 2.37037037037037, 2.44140625, 2.4883199999999994, 2.5216263717421135]

# С использованием list comprehensions 

n = int(input('Введите N: '))
result = [(1+1/i)**i for i in range(1, n+1)]

print(result)
print(sum(result[:]))

